// В этом файле содержится исходный код программы на C++.

// Функция main - входная точка программы на C++.

/*
 * Соответствия в другим языка программирования:
 * - Python: if __name__ == '__main__' ...
 * - Java: public static void main(String[] args) ...
 */

int main(int argc, char **argv) {
  // Внутри скобок {} находится "тело функции" - выполняемые инструкции.

  // Параметры функции:
  // 1. argc - кол-во входных аргументов
  // 2. argv - массив из массива символов (т.е. массив строк)

  // Функция возвращает целочисленное значение (int = integer):
  //  0 - все ОК
  //  все остальное - НЕ ОК
  return 0;
}

/*
 * Задания:
 * 1. Запустите программу. Что она выводит?
 * 2. Внесите изменения в возвращаемое значение функции. Что теперь выводит программа?
 */
